


var music = [
    {
        titles: "Live Forever, 2015",
        artist: "Lil Peep",
        cover: "img/Live_Forever.jpg",
        disctiption: ""
    },
    {
        titles: "7th Or St. Tammany, 2015",
        artist: "$uicideBoy$",
        cover: "img/7th_or_st.jpg",
        disctiption: ""
    },
    {
        titles: "Poison Ivy, 2018",
        artist: "Yung Lean",
        cover: "img/Poison_Ivy.jpg",
        disctiption: ""
    },
    {
        titles: "Jackboys, 2019",
        artist: "Travis Scott",
        cover: "img/jackboys.jpg",
        disctiption: ""
    },
    {
        titles: "DeadBoy, 2014",
        artist: "Bones",
        cover: "img/dead_boy.jpg",
        disctiption: ""
    },
    {
        titles: "Donda, 2021",
        artist: "Kanye West",
        cover: "img/donda.png",
        disctiption: ""
    },
    {
        titles: "Ballads 1, 2018",
        artist: "Joji",
        cover: "img/ballads1.png",
        disctiption: ""
    },
    {
        titles: "Channel Orange, 2012",
        artist: "Frank Ocean",
        cover: "img/channel_orange.jpg",
        disctiption: ""
    }
];

var book = [
    {
        titles: "О мышах и людях, 1937",
        artist: "Джон Стейнбек",
        cover: "img/mice_and_man.jpeg",
        disctiption: "Повесть, опубликована в 1937 году, рассказывет трагическую историю двух сезонных рабочих во время Великой депрессии в Калифорнии и касающаяся таких понятий, как мечта, вина и сочувствие. Книга основана на личном опыте Стейнбека, работавшего в сельском хозяйстве в 1920-е годы.",
    },
    {
        titles: "Песочные Часы, 2008",
        artist: "Недоруб С.И.",
        cover: "img/pes_cha.jpg",
        disctiption: "В Чернобыльской Зоне отчуждения появляется молодой сталкер-новичок по имени Марк, быстро заработавший внимание благодаря удивительному таланту выживания и череде связанных с ним загадок. Выясняется, что загадочный сталкер каким-то непостижимым образом знает о Зоне больше, чем любой из сталкеров-ветеранов. Он намерен проникнуть через Заслон. Более того — у него на то есть личные причины, связанные с известной ему одному тайной, которая привела его в Зону…",
    },
    {
        titles: "Граф Монте-Кристо, 1846",
        artist: "Александр Дюма",
        cover: "img/earl.jpg",
        disctiption: "Сюжет «Графа Монте-Кристо» был почерпнут Александром Дюма из архивов парижской полиции. Подлинная жизнь Франсуа Пико под пером блестящего мастера историко-приключенческого жанра превратилась в захватывающую историю об Эдмоне Дантесе, узнике замка Иф. Совершив дерзкий побег, он возвращается в родной город, чтобы свершить правосудие – отомстить тем, кто разрушил его жизнь. Толстый роман, не отпускающий до последней страницы, «Граф Монте-Кристо» – классика, которую действительно перечитывают.",
    },
    {
        titles: "Стрелок, 1982",
        artist: "Стивен Кинг",
        cover: "img/shooter.jpg",
        disctiption: "Сюжет «Графа Монте-Кристо» был почерпнут Александром Дюма из архивов парижской полиции. Подлинная жизнь Франсуа Пико под пером блестящего мастера историко-приключенческого жанра превратилась в захватывающую историю об Эдмоне Дантесе, узнике замка Иф. Совершив дерзкий побег, он возвращается в родной город, чтобы свершить правосудие – отомстить тем, кто разрушил его жизнь. Толстый роман, не отпускающий до последней страницы, «Граф Монте-Кристо» – классика, которую действительно перечитывают.",
    }
]

var film = [
    {
        titles: "Тьма, 2017",
        artist: "Сериал, 3 сезона",
        cover: "img/dark.jpg",
        disctiption: "Немецкий драматический и научно-фантастический веб-сериал, созданный Бараном бо Одаром и Янтье Фризе[de]. Он состоит из трёх сезонов, выходивших с 2017 по 2020 год. Действие сериала разворачивается в вымышленном городке Винден (Германия). События, начало которым положило исчезновение двух детей, раскрывают тайны и скрытые связи четырёх семей Виндена, которые постепенно узнают зловещую тайну о путешествиях во времени, затрагивающих несколько поколений. На протяжении всего сериала исследуются экзистенциальный смысл времени и его влияние на человеческую природу."
    },
    {
        titles: "Ковбой Бибоп, 1998",
        artist: "Сериал, 3 сезона",
        cover: "img/cowboy_bebop.png",
        disctiption: "Немецкий драматический и научно-фантастический веб-сериал, созданный Бараном бо Одаром и Янтье Фризе[de]. Он состоит из трёх сезонов, выходивших с 2017 по 2020 год. Действие сериала разворачивается в вымышленном городке Винден (Германия). События, начало которым положило исчезновение двух детей, раскрывают тайны и скрытые связи четырёх семей Виндена, которые постепенно узнают зловещую тайну о путешествиях во времени, затрагивающих несколько поколений. На протяжении всего сериала исследуются экзистенциальный смысл времени и его влияние на человеческую природу."
    },
    {
        titles: "Hunter X Hunter, 2011",
        artist: "Сериал, 3 сезона",
        cover: "img/hxh.png",
        disctiption: "Немецкий драматический и научно-фантастический веб-сериал, созданный Бараном бо Одаром и Янтье Фризе[de]. Он состоит из трёх сезонов, выходивших с 2017 по 2020 год. Действие сериала разворачивается в вымышленном городке Винден (Германия). События, начало которым положило исчезновение двух детей, раскрывают тайны и скрытые связи четырёх семей Виндена, которые постепенно узнают зловещую тайну о путешествиях во времени, затрагивающих несколько поколений. На протяжении всего сериала исследуются экзистенциальный смысл времени и его влияние на человеческую природу."
    },
    {
        titles: "Варкрафт, 2016",
        artist: "Сериал, 3 сезона",
        cover: "img/warcraft.jpg",
        disctiption: "Немецкий драматический и научно-фантастический веб-сериал, созданный Бараном бо Одаром и Янтье Фризе[de]. Он состоит из трёх сезонов, выходивших с 2017 по 2020 год. Действие сериала разворачивается в вымышленном городке Винден (Германия). События, начало которым положило исчезновение двух детей, раскрывают тайны и скрытые связи четырёх семей Виндена, которые постепенно узнают зловещую тайну о путешествиях во времени, затрагивающих несколько поколений. На протяжении всего сериала исследуются экзистенциальный смысл времени и его влияние на человеческую природу."
    }
]

var game = [
    {
        titles: "S.T.A.L.K.E.R.",
        artist: "Серия игр",
        cover: "img/game.jpg",
        disctiption: "S.T.A.L.K.E.R. — серия игр, разработанная украинской компанией GSC Game World. Создана в жанре шутера от первого лица и survival horror с элементами ролевой игры и action-adventure. События игр разворачиваются в наше время, в альтернативном мире на территории Украины, в Чернобыльской зоне отчуждения. Согласно сюжету серии, в 2006 году зона подверглась неожиданному аномальному воздействию (Выбросу), в результате которого физические, химические и биологические процессы на данной территории изменились. Появилось множество аномалий, артефактов и мутантов. В идеях игры можно увидеть влияние повести братьев Стругацких «Пикник на обочине» и снятого по ней фильма Андрея Тарковского «Сталкер»."
    },
    {
        titles: "The Elder Scrolls V: Skyrim",
        artist: "Игра из серии",
        cover: "img/skyrim.jpg",
        disctiption: "Подобно предыдущим играм серии, Skyrim предоставляет игроку возможность свободно путешествовать по обширному игровому миру, исследуя его и самостоятельно находя новые места и задания. Действие Skyrim происходит в вымышленной провинции Скайрим на материке Тамриэль на планете Нирн спустя двести лет после событий предыдущей игры серии — The Elder Scrolls IV: Oblivion. Основная сюжетная линия игры связана с появлением в Скайриме могущественного дракона Алдуина; на главного героя, «Драконорождённого», возложена задача остановить возвращение драконов и сразить Алдуина. Игра получила высокие оценки критиков и собрала ряд наград, в том числе звания лучшей игры 2011 года Spike Video Game Award, звания «Игры года» и «Ролевой игры года» от IGN и Gamespot. Ей также сопутствовал коммерческий успех: на 2014 год число проданных во всем мире копий игры превысило 20 миллионов, а к ноябрю 2016 — уже 30 миллионов."
    },
    {
        titles: "Far Cry 3",
        artist: "Игра из серии",
        cover: "img/far_cry_3.jpg",
        disctiption: "Действие игры происходит на тропическом острове, омываемом Индийским и Тихим океанами. Игрок принимает роль Джейсона Броди, молодого американца, отправившегося с друзьями на отдых, но в дальнейшем попавшего в плен банды пиратов. После побега он прилагает все усилия, чтобы спасти своих друзей и убить главаря банды пиратов, Вааса Монтенегро. Игра достигла высоких показателей продаж. Спустя два года после релиза Ubisoft объявил, что было продано 10 млн копий Far Cry 3. 18 ноября 2014 года вышел его преемник Far Cry 4."
    }
]

function hobby(nsect, ...arr){
    var i, j, sec, d, img, h, ho, hp, covername, artistname, disc;
        for (i=0; i<arr.length; i++){
            d = document.createElement("div");
            d.classList.add("album");
            img = document.createElement("img");
            img.src = arr[i].cover;
            h = document.createElement("h4");
            ho = document.createElement("h4");
            hp = document.createElement("h5");
            covername = document.createTextNode(arr[i].titles);
            artistname = document.createTextNode(arr[i].artist);
            disc = document.createTextNode(arr[i].disctiption);
            h.appendChild(covername);
            ho.appendChild(artistname);
            hp.appendChild(disc);
            d.appendChild(img);
            d.appendChild(h);
            d.appendChild(ho);
            d.appendChild(hp);
            sec = document.getElementById(nsect);
            sec.appendChild(d);
        }
    return;
}

hobby("sctn1", ...music);
hobby("sctn2", ...book);
hobby("sctn3", ...film);
hobby("sctn4", ...game);